src/cf/Catalogs/ExchangeMessageTransportSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ExchangeMessageTransportSettings</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Peer</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ExchangePlansDSL</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TransportID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultSetting</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Settings</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Setting</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ExchangeMessageTransportServerCall/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#Region Internal

Procedure SetDataSynchronizationPassword(Val Peer, Val AuthenticationData) Export
	
	ExchangeMessagesTransport.SetDataSynchronizationPassword(Peer, AuthenticationData);
	
EndProcedure

Function FullNameOfFirstSetupForm(Val TransportID) Export
	
	Return ExchangeMessagesTransport.FullNameOfFirstSetupForm(TransportID)
	
EndFunction

Function FullNameOfConfigurationForm(Val TransportID) Export
	
	Return ExchangeMessagesTransport.FullNameOfConfigurationForm(TransportID)
	
EndFunction

Procedure SaveTransportSettings(Val Peer, Val TransportID, Val TransportSettings) Export
	
	ExchangeMessagesTransport.SaveTransportSettings(Peer, TransportID, TransportSettings);
	
EndProcedure

Function TransportSettings(Val Peer, Val TransportID) Export
	
	Return Catalogs.ExchangeMessageTransportSettings.TransportSettings(
		Peer, TransportID);
	
EndFunction

Procedure ProcessChangesToTransportSettings(Val Peer, Val TransportID, Val TransportSettings, RequiredAttributesOfSettingsAreFilledIn) Export
	
	SaveTransportSettings(
		Peer,
		TransportID,
		TransportSettings);
		
	RequiredAttributesOfSettingsAreFilledIn = ExchangeMessagesTransport.RequiredAttributesOfTransportSettingsHaveBeenFilledIn(TransportSettings, TransportID);
			
EndProcedure

#EndRegion

#Region Private

Function DefaultTransport(Val Peer) Export

	Return Catalogs.ExchangeMessageTransportSettings.DefaultTransport(Peer);
	
EndFunction

Function AssignDefaultTransport(Val Peer, Val TransportID) Export
	
	Catalogs.ExchangeMessageTransportSettings.AssignDefaultTransport(
		Peer, TransportID);
	
EndFunction

Function AuthenticationRequired(Val AuthenticationParameters, FormName) Export
	
	Return ExchangeMessagesTransport.AuthenticationRequired(AuthenticationParameters, FormName);
	
EndFunction

#EndRegion
